# Виртуальный Обломов

*Вашему вниманию представлена мини-программа, имитировавшая образ жизни Обломова, главного героя из известного литературного произведения И.А. Гончарова "Обломов". Приятного времяпрепровождения!*
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
Инструкция по установке:
Перейдите по ссылке [Виртуальный Обломов](https://otvet.mail.ru/question/192867742).
А теперь... закройте эту ссылку, ведь она не пригодится вовсе! Если Вы читаете данную инструкцию, то это значит, что виртуальный Обломов уже установлен и мирно лежит в Вашем устройстве!
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
Инструкция по использованию:
Просто запустите программу при помощи F5
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
**Код программы:**
```python
def Oblomov(days):
    if days != 0:
        while days>0:
            print('День ',days, ': ')
            print('ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ')
            print('Ням-ням-ням')
            print('ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ')
            days -= 1
    else:
        print('Вам неинтересна жизнь Обломова?')
Oblomov(int(input('Введите, сколько дней Вы хотите увидеть из жизни Обломова: ')))
```

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
**АВТОРЫ:**
Третьякова Анастасия Алексеевна
**Лецензия**
Неофициально есть, официально отсутствует.
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
*Свяжитесь с нами!*
Тел.: 88005553535, Санкт-Петербург, ул. Гороховая

