#INTRO TO IT 2nd COURSE
# Задача: найти второе наибольшее число в списке
def second_largest(numbers):
    '''
    Функция меняет местами первое и второе максимальные числа,
    если следующее в последовательности число оказывается больше первого,
    и в таком случае первому числу присваивается значение числа, что больше него, а
    второму - первого числа.
    '''
    #Присваиваем минимальное значение -минус бесконечность будущим первому максимальному и второму наибольшему значениям 
    first = second = float('-inf')
    #Перебираем и сравниваем числа.
    for n in numbers: 
        if n > first:
            first, second = n, first
        elif first > n > second:
            second = n
    # Возвращаем второе наибольшее число, если оно не равно минус бесконечности, иначе его нет.
    return second if second != float('-inf') else None

print(second_largest([10, 4, 9, 4, 9, 10, 4]))  # Должно вывести 9
