#INTRO TO IT 2nd COURSE
# Задача: проверить, является ли число простым
def is_prime(num):

    """
    Функция для проверки, является ли число простым
    :param num: число, которое нужно проверить
    :return : True - если число простое, иначе False
    :Note : Достаточно перебирать числа от 2 до корня из 
            исходного числа, так как остальные 
            возможные делители числа будут получаться
            в результате деления числа на эти делители
            (Делители парные)
    """
    if num <= 1:
        return False
    for i in range(2, int(num**0.5) + 1):
        if num % i == 0:
            return False
    return True
