#INTRO TO IT 2nd COURSE
# Задача: создать словарь, где ключи - числа от 1 до N, а значения - квадраты этих чисел
def squares_dict(n):
    '''
    Функция для создания словаря, где ключи - числа от 1 до N, \
        значения - квадраты этих чисел
    :param n: Число - граница списка
    :return: Словарь из чисел
    '''
    return {i: i ** 2 for i in range(1, n+1)}  

print(squares_dict(5))  
